In [3]:
import numpy as np
arr=np.array([1,2,3,4,5],dtype="float")

In [4]:
arr

array([1., 2., 3., 4., 5.])

## pandas
- It is a important module in data science libraries
- Stands for pannel data
- data Structures
    - series
    - dataframes
- with this we can do the data
analysis, manipulation, cleaning
- data analysation
    - statistics of the data
    - volume of the data
- data manipulation
    - changing data from one form to another
- data cleaning
    - removing unwanted data
    - deleting null values and Nan values...etc!

In [5]:
import pandas as pd

In [6]:
pd.__version__

'1.2.4'

In [7]:
#we can create the pandas series with list, string, tuple and also directionaries

In [11]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p17', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [10]:
a=pd.Series("I'm from VR")
a

0    I'm from VR
dtype: object

In [12]:
b=input()
c=pd.Series(b.split(" "))
c

I'm from VR

0     I'm
1    from
2      VR
dtype: object

In [13]:
t=(4,5,6,7,8)
t1=pd.Series(t)
t1

0    4
1    5
2    6
3    7
4    8
dtype: int64

In [14]:
l1=[2,3,4,5,6]
l2=pd.Series(l1)
l2

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [15]:
d={1:2,2:3,3:4,4:5}
d1=pd.Series(d)
d1

1    2
2    3
3    4
4    5
dtype: int64

In [16]:
d=pd.Series(range(20,26))
d

0    20
1    21
2    22
3    23
4    24
5    25
dtype: int64

In [19]:
dic={"list":[1,2,3],"tuple":(1,2,3),"string":"hii","integer":4}
dic

{'list': [1, 2, 3], 'tuple': (1, 2, 3), 'string': 'hii', 'integer': 4}

In [20]:
d=pd.Series(dic)
d

list       [1, 2, 3]
tuple      (1, 2, 3)
string           hii
integer            4
dtype: object

In [21]:
d.index

Index(['list', 'tuple', 'string', 'integer'], dtype='object')

In [22]:
arr=np.arange(10,50,5)
arr1=pd.Series(arr)
arr1

0    10
1    15
2    20
3    25
4    30
5    35
6    40
7    45
dtype: int32

In [23]:
arr1[0]

10

In [24]:
len(arr1)

8

In [25]:
arr1[len(arr)-1]

45

In [26]:
arr1.index

RangeIndex(start=0, stop=8, step=1)

In [27]:
arr1.index=[223,122,122,3344,2334,123,422,155]
arr1

223     10
122     15
122     20
3344    25
2334    30
123     35
422     40
155     45
dtype: int32

In [29]:
li=["hi","hello","good","hope"]
pd.Series(li,index=(1,2,3,4))

1       hi
2    hello
3     good
4     hope
dtype: object

In [30]:
li=["hi","hello","good","hope"]
ind=[i for i in range(15,19)]
pd.Series(li,index=ind)

15       hi
16    hello
17     good
18     hope
dtype: object

In [31]:
d

list       [1, 2, 3]
tuple      (1, 2, 3)
string           hii
integer            4
dtype: object

In [32]:
dic

{'list': [1, 2, 3], 'tuple': (1, 2, 3), 'string': 'hii', 'integer': 4}

In [33]:
dict2=pd.Series(dic,index=ind)
dict2

15    NaN
16    NaN
17    NaN
18    NaN
dtype: object

In [34]:
dict2.index

Int64Index([15, 16, 17, 18], dtype='int64')

### Data Frames
- data is in 2nd format

In [35]:
import pandas as ad
import numpy as np
pd.DataFrame(dic)

   list  tuple string  integer
0     1      1    hii        4
1     2      2    hii        4
2     3      3    hii        4

In [38]:
data={56:"fiftysix","float":10.23,"prgm":"workshop","name":"DA"}

In [39]:
data

{56: 'fiftysix', 'float': 10.23, 'prgm': 'workshop', 'name': 'DA'}

In [41]:
pd.DataFrame(data,index="i am in VR".split(" "))

          56  float      prgm name
i   fiftysix  10.23  workshop   DA
am  fiftysix  10.23  workshop   DA
in  fiftysix  10.23  workshop   DA
VR  fiftysix  10.23  workshop   DA

In [42]:
df1=pd.DataFrame(dic)
df2=pd.DataFrame(data,index="i am in Vr".split(" "))

In [43]:
pd.concat([df1,df2])

    list  tuple string  integer        56  float      prgm name
0    1.0    1.0    hii      4.0       NaN    NaN       NaN  NaN
1    2.0    2.0    hii      4.0       NaN    NaN       NaN  NaN
2    3.0    3.0    hii      4.0       NaN    NaN       NaN  NaN
i    NaN    NaN    NaN      NaN  fiftysix  10.23  workshop   DA
am   NaN    NaN    NaN      NaN  fiftysix  10.23  workshop   DA
in   NaN    NaN    NaN      NaN  fiftysix  10.23  workshop   DA
Vr   NaN    NaN    NaN      NaN  fiftysix  10.23  workshop   DA

In [47]:
dict3={"first":[1,2,3,4],"second":[5,6,7,8],"third":(45,56,78,79)}
dict3

{'first': [1, 2, 3, 4], 'second': [5, 6, 7, 8], 'third': (45, 56, 78, 79)}

In [48]:
df3=pd.DataFrame(dict3,index=[2001,2002,2003,2004])
df3

      first  second  third
2001      1       5     45
2002      2       6     56
2003      3       7     78
2004      4       8     79

In [51]:
df4=pd.DataFrame({'fourth':[10,20,30,40],'fifth':[50,60,70,80],'sixth':(450,500,780,790)},index=[2008,2002,2003,2007])
df4

      fourth  fifth  sixth
2008      10     50    450
2002      20     60    500
2003      30     70    780
2007      40     80    790

In [52]:
df3.join(df4)

      first  second  third  fourth  fifth  sixth
2001      1       5     45     NaN    NaN    NaN
2002      2       6     56    20.0   60.0  500.0
2003      3       7     78    30.0   70.0  780.0
2004      4       8     79     NaN    NaN    NaN

In [53]:
df4.join(df3)

      fourth  fifth  sixth  first  second  third
2008      10     50    450    NaN     NaN    NaN
2002      20     60    500    2.0     6.0   56.0
2003      30     70    780    3.0     7.0   78.0
2007      40     80    790    NaN     NaN    NaN

In [61]:
df5=pd.DataFrame({"a":[78,89,156,23],"b":(45,67,23,76),"c":[67,89,45,23]},index="these are integer values".split(" "))
df5

           a   b   c
these     78  45  67
are       89  67  89
integer  156  23  45
values    23  76  23

In [62]:
df6=pd.DataFrame({"a":[78,89,156,23],"b":(45,67,23,76),"c":[67,89,45,23]},index="these are integer values".split(" "))
df6

           a   b   c
these     78  45  67
are       89  67  89
integer  156  23  45
values    23  76  23

In [64]:
df5.merge(df6,on='c')

   a_x  b_x   c  a_y  b_y
0   78   45  67   78   45
1   89   67  89   89   67
2  156   23  45  156   23
3   23   76  23   23   76

In [68]:
new=df5.merge(df6)
new.columns=["ab","ba","cb"]
new

    ab  ba  cb
0   78  45  67
1   89  67  89
2  156  23  45
3   23  76  23

In [71]:
new=df5.merge(df6)
new.columns=["ab","ba","cb"]
new.index=(20,30,40,56)
new

     ab  ba  cb
20   78  45  67
30   89  67  89
40  156  23  45
56   23  76  23

In [72]:
dt=pd.date_range('2022-01-01','2022-01-15')
dt

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10', '2022-01-11', '2022-01-12',
               '2022-01-13', '2022-01-14', '2022-01-15'],
              dtype='datetime64[ns]', freq='D')

In [73]:
dt=pd.date_range('2022-01-01','2022-01-15',periods=6)
pd.Series(dt)

0   2022-01-01 00:00:00
1   2022-01-03 19:12:00
2   2022-01-06 14:24:00
3   2022-01-09 09:36:00
4   2022-01-12 04:48:00
5   2022-01-15 00:00:00
dtype: datetime64[ns]

In [74]:
dt=pd.date_range('2022-01-01','2022-01-15',periods=6)
dt

DatetimeIndex(['2022-01-01 00:00:00', '2022-01-03 19:12:00',
               '2022-01-06 14:24:00', '2022-01-09 09:36:00',
               '2022-01-12 04:48:00', '2022-01-15 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [77]:
temp=[23,45,67,89,34,49]
pd.Series(temp,index=dt)

2022-01-01 00:00:00    23
2022-01-03 19:12:00    45
2022-01-06 14:24:00    67
2022-01-09 09:36:00    89
2022-01-12 04:48:00    34
2022-01-15 00:00:00    49
dtype: int64

In [78]:
temp=[23,45,67,89,34,49]
dt1=pd.Series(temp,index=dt)

In [79]:
dt1["2022-01-06"]

2022-01-06 14:24:00    67
dtype: int64

## working  with .csv files
- reading .csv file with "read_csv()" method
- syntax:- pd.read_csv("file location")

In [80]:
#reading file
data=pd.read_csv("marks.csv")
data

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [81]:
#sample
data.sample()

  Roll Name  Maths  Discrete  OS    CO    DS
5   B2    J     63        45  67  56.0  50.0

In [82]:
#head
data.head(3)

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        70  30  70.0  90.0
1   A2    Y     90        45  67  73.0  50.0
2   A1    G     60        70  30   NaN  90.0

In [83]:
data["Roll"] #accessing a single col data

0     A1
1     A2
2     A1
3     A2
4     B1
5     B2
6     C1
7     C2
8     D1
9     D2
10    E1
11    E2
Name: Roll, dtype: object

In [86]:
data[["Roll","Name","Maths"]]

   Roll Name  Maths
0    A1    X     60
1    A2    Y     90
2    A1    G     60
3    A2    H     40
4    B1    I     50
5    B2    J     63
6    C1    K     67
7    C2    L     91
8    D1    M     40
9    D2    N      5
10   E1    X     50
11   E2    Y     60

In [87]:
new=pd.read_csv("marks.csv",usecol=["Name","Maths"])

TypeError: read_csv() got an unexpected keyword argument 'usecol'

In [88]:
data.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [89]:
data.index

RangeIndex(start=0, stop=12, step=1)

In [90]:
data.dtypes

Roll         object
Name         object
Maths         int64
Discrete      int64
OS            int64
CO          float64
DS          float64
dtype: object

In [91]:
data.info #textual info like prnting

<bound method DataFrame.info of    Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
1    A2    Y     90        45  67  73.0  50.0
2    A1    G     60        70  30   NaN  90.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0>

In [92]:
data.describe() # statistcs of the data

           Maths   Discrete         OS         CO         DS
count  12.000000  12.000000  12.000000  10.000000   9.000000
mean   56.333333  60.583333  56.333333  68.900000  65.555556
std    22.928083  11.851032  21.465970  13.042239  23.511227
min     5.000000  45.000000  30.000000  50.000000  40.000000
25%    47.500000  45.000000  30.000000  59.500000  50.000000
50%    60.000000  68.500000  66.000000  72.500000  50.000000
75%    64.000000  70.000000  68.500000  74.500000  90.000000
max    91.000000  70.000000  90.000000  90.000000  90.000000

In [93]:
data.Maths.value_counts()

60    3
50    2
40    2
67    1
5     1
90    1
91    1
63    1
Name: Maths, dtype: int64

In [94]:
data.sort_values("Roll")

   Roll Name  Maths  Discrete  OS    CO    DS
0    A1    X     60        70  30  70.0  90.0
2    A1    G     60        70  30   NaN  90.0
1    A2    Y     90        45  67  73.0  50.0
3    A2    H     40        60  73  50.0   NaN
4    B1    I     50        70  90  90.0   NaN
5    B2    J     63        45  67  56.0  50.0
6    C1    K     67        70  30  75.0  40.0
7    C2    L     91        45  67  72.0  50.0
8    D1    M     40        70  50   NaN  90.0
9    D2    N      5        67  65  50.0   NaN
10   E1    X     50        70  30  80.0  90.0
11   E2    Y     60        45  77  73.0  40.0

In [95]:
data["Total"]=100 # adding another sol
data

   Roll Name  Maths  Discrete  OS    CO    DS  Total
0    A1    X     60        70  30  70.0  90.0    100
1    A2    Y     90        45  67  73.0  50.0    100
2    A1    G     60        70  30   NaN  90.0    100
3    A2    H     40        60  73  50.0   NaN    100
4    B1    I     50        70  90  90.0   NaN    100
5    B2    J     63        45  67  56.0  50.0    100
6    C1    K     67        70  30  75.0  40.0    100
7    C2    L     91        45  67  72.0  50.0    100
8    D1    M     40        70  50   NaN  90.0    100
9    D2    N      5        67  65  50.0   NaN    100
10   E1    X     50        70  30  80.0  90.0    100
11   E2    Y     60        45  77  73.0  40.0    100

In [96]:
data.Maths.sum()

676

In [97]:
data.OS.sum()

676

In [98]:
data.CO.sum()

689.0

In [99]:
data.isnull()

     Roll   Name  Maths  Discrete     OS     CO     DS  Total
0   False  False  False     False  False  False  False  False
1   False  False  False     False  False  False  False  False
2   False  False  False     False  False   True  False  False
3   False  False  False     False  False  False   True  False
4   False  False  False     False  False  False   True  False
5   False  False  False     False  False  False  False  False
6   False  False  False     False  False  False  False  False
7   False  False  False     False  False  False  False  False
8   False  False  False     False  False   True  False  False
9   False  False  False     False  False  False   True  False
10  False  False  False     False  False  False  False  False
11  False  False  False     False  False  False  False  False

In [101]:
data.isnull().sum()

Roll        0
Name        0
Maths       0
Discrete    0
OS          0
CO          2
DS          3
Total       0
dtype: int64

In [102]:
data.nunique()

Roll        10
Name        10
Maths        8
Discrete     4
OS           7
CO           8
DS           3
Total        1
dtype: int64